
### :robot: Terraform Report
---
##### Plan: `12` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.argocd[0] will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                configs:
                  params:
                    server.insecure: true
            EOT,
        ]
      + verify                     = false
      + version                    = "7.6.12"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "global.domain"
          + value = "argocd.dev.innovatshub.com"
        }
    }

  # helm_release.argocd_app_grafana[0] will be created
  + resource "helm_release" "argocd_app_grafana" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-grafana"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  grafana:
                    namespace: argocd
                    project: grafana
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: grafana
                      repoURL: https://grafana.github.io/helm-charts
                      targetRevision: 8.5.8
                      helm:
                        releaseName: grafana
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: monitoring
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                  loki:
                    namespace: argocd
                    project: grafana
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: loki-stack
                      repoURL: https://grafana.github.io/helm-charts
                      targetRevision: 2.10.2
                      helm:
                        releaseName: loki
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: monitoring
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  grafana:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Grafana for Monitoring
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: monitoring
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.argocd_app_kiali[0] will be created
  + resource "helm_release" "argocd_app_kiali" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-kiali"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  kiali:
                    namespace: argocd
                    project: kiali
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                
                    sources:
                    - chart: kiali-server
                      repoURL: https://kiali.org/helm-charts
                      targetRevision: 2.0.0
                      helm:
                        releaseName: kiali
                        parameters:
                          - name: auth.strategy
                            value: "token"
                          - name: external_services.prometheus.url
                            value: "http://prometheus-server.monitoring.svc.cluster.local"
                          - name: external_services.grafana.enabled
                            value: "false"
                          - name: external_services.custom_dashboards.enabled
                            value: "false"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
                
                projects:
                  kiali:
                    namespace: argocd
                    finalizers:
                    - resources-finalizer.argocd.argoproj.io
                    description: Project Kiali for Service Mesh
                    sourceRepos:
                    - '*'
                    destinations:
                    - namespace: istio-system
                      server: https://kubernetes.default.svc
                    clusterResourceWhitelist:
                    - group: '*'
                      kind: '*'
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.certmanager[0] will be created
  + resource "helm_release" "certmanager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                crds:
                  enabled: true
                replicaCount: 3
                extraArgs:
                  - --dns01-recursive-nameservers=1.1.1.1:53,9.9.9.9:53
                  - --dns01-recursive-nameservers-only
                podDnsPolicy: None
                podDnsConfig:
                  nameservers:
                    - 1.1.1.1
                    - 9.9.9.9
            EOT,
        ]
      + verify                     = false
      + version                    = "v1.16.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istio_base[0] will be created
  + resource "helm_release" "istio_base" {
      + atomic                     = false
      + chart                      = "base"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-base"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.23.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "global.istioNamespace"
          + value = "istio-system"
        }
    }

  # helm_release.istio_gateway[0] will be created
  + resource "helm_release" "istio_gateway" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-gateway"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.23.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.istiod[0] will be created
  + resource "helm_release" "istiod" {
      + atomic                     = false
      + chart                      = "istiod"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-istiod"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.23.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "global.istioNamespace"
          + value = "istio-system"
        }
      + set {
          + name  = "meshConfig.ingressSelector"
          + value = "gateway"
        }
      + set {
          + name  = "meshConfig.ingressService"
          + value = "istio-gateway"
        }
      + set {
          + name  = "telemetry.enabled"
          + value = "true"
        }
    }

  # helm_release.prometheus[0] will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = false
      + chart                      = "prometheus"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "25.27.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.cloudflare_secret_token[0] will be created
  + resource "kubectl_manifest" "cloudflare_secret_token" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "cloudflare-secret-token"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Secret
            metadata:
              name: cloudflare-secret-token
              namespace: cert-manager
            stringData:
              cloudflare-token: 19hoC4Vy9bDcvOXOmQMLup3OAjyGRKNwpg54TcJ9
            type: Opaque
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.gateway_ingress_dev[0] will be created
  + resource "kubectl_manifest" "gateway_ingress_dev" {
      + api_version             = "networking.istio.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Gateway"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "innovatshub_dev"
      + namespace               = "istio-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: networking.istio.io/v1
            kind: Gateway
            metadata:
              name: innovatshub_dev
              namespace: istio-system
            spec:
              selector:
                istio: gateway
              servers:
              - hosts:
                - '*.dev.innovatshub.com'
                port:
                  name: http
                  number: 80
                  protocol: HTTP
                tls:
                  httpsRedirect: true
              - hosts:
                - '*.dev.innovatshub.com'
                port:
                  name: https
                  number: 443
                  protocol: HTTPS
                tls:
                  credentialName: wildcard-dev-innovatshub-com-tls
                  mode: SIMPLE
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt_certificate_wildcard_dev[0] will be created
  + resource "kubectl_manifest" "letsencrypt_certificate_wildcard_dev" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Certificate"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "wildcard-dev-innovatshub-com"
      + namespace               = "istio-system"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: Certificate
            metadata:
              name: wildcard-dev-innovatshub-com
              namespace: istio-system
            spec:
              dnsNames:
              - '*.dev.innovatshub.com'
              duration: 2160h
              isCA: false
              issuerRef:
                group: cert-manager.io
                kind: ClusterIssuer
                name: letsencrypt-cloudflare
              privateKey:
                algorithm: RSA
                encoding: PKCS1
                size: 2048
              renewBefore: 360h
              secretName: wildcard-dev-innovatshub-com-tls
              subject:
                organizations:
                - innovatshub
              usages:
              - server auth
              - client auth
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt_cloudflare[0] will be created
  + resource "kubectl_manifest" "letsencrypt_cloudflare" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-cloudflare"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-cloudflare
              namespace: cert-manager
            spec:
              acme:
                email: douglas.nascimento@innovatshub.com
                privateKeySecretRef:
                  name: letsencrypt-cloudflare
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - dns01:
                    cloudflare:
                      apiTokenSecretRef:
                        key: cloudflare-token
                        name: cloudflare-secret-token
                      email: douglas.nascimento@innovatshub.com
                  selector:
                    dnsZones:
                    - innovatshub.com
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11543129085`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11543129085) - commit 6d75e323e0ca8132e6cda662af78529caecc5f0e
